DATA ENCODING => categorical to numeric values
1. Nominal or One hot encoding
2. Label or Ordinal
3. Target Guided Ordinal

One hot encoding

In [2]:
from sklearn.preprocessing import OneHotEncoder
import pandas as pd

In [15]:
df = pd.DataFrame({
    'color' :['red', 'blue','green','red', 'green','blue']
})

In [4]:
df

   color
0    red
1   blue
2  green
3    red
4  green
5   blue

In [8]:
# create an instance of ohe
encoder = OneHotEncoder()
val = encoder.fit_transform(df[['color']]).toarray()

In [11]:
enc_df = pd.DataFrame(val, columns=encoder.get_feature_names_out())

In [12]:
enc_df

   color_blue  color_green  color_red
0         0.0          0.0        1.0
1         1.0          0.0        0.0
2         0.0          1.0        0.0
3         0.0          0.0        1.0
4         0.0          1.0        0.0
5         1.0          0.0        0.0

In [14]:
pd.concat([df, enc_df], axis = 1)

   color  color_blue  color_green  color_red
0    red         0.0          0.0        1.0
1   blue         1.0          0.0        0.0
2  green         0.0          1.0        0.0
3    red         0.0          0.0        1.0
4  green         0.0          1.0        0.0
5   blue         1.0          0.0        0.0

Label Encoding

In [16]:
from sklearn.preprocessing import LabelEncoder
encoder = LabelEncoder()
encoder.fit_transform(df[['color']])

/usr/lib/python3/dist-packages/sklearn/preprocessing/_label.py:114: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

array([2, 0, 1, 2, 1, 0])

In [17]:
encoder.transform([['red']])

/usr/lib/python3/dist-packages/sklearn/preprocessing/_label.py:132: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, dtype=self.classes_.dtype, warn=True)

array([2])

Ordinal Encoding

In [21]:
from sklearn.preprocessing import OrdinalEncoder
df = pd.DataFrame({
    'size' : ['small', 'medium', 'large', 'medium', 'small', 'large']
})

In [22]:
enc = OrdinalEncoder(categories=[['small', 'medium','large']])
enc.fit_transform(df[['size']])

array([[0.],
       [1.],
       [2.],
       [1.],
       [0.],
       [2.]])

In [23]:
enc.transform([['small']])

/usr/lib/python3/dist-packages/sklearn/base.py:493: UserWarning: X does not have valid feature names, but OrdinalEncoder was fitted with feature names
  warnings.warn(

array([[0.]])

Target Guided Ordinal Encoding

In [27]:
df = pd.DataFrame({
    'city': ['New York', 'London', 'Paris', 'Tokyo', 'Paris', 'New York'],
    'price': [200,150,300,250,320,180]
})

In [29]:
mean_price = df.groupby('city')['price'].mean()

In [30]:
df['city_enc'] = df['city'].map(mean_price)

In [31]:
df

       city  price  city_enc
0  New York    200     190.0
1    London    150     150.0
2     Paris    300     310.0
3     Tokyo    250     250.0
4     Paris    320     310.0
5  New York    180     190.0

In [36]:
import seaborn as sns
df = sns.load_dataset('tips')
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [41]:
bill = df.groupby('time')['total_bill'].mean().to_dict()

/tmp/ipykernel_67193/3178262334.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  bill = df.groupby('time')['total_bill'].mean().to_dict()

In [42]:
df['time_encoded'] = df['time'].map(bill)

In [43]:
df

     total_bill   tip     sex smoker   day    time  size time_encoded
0         16.99  1.01  Female     No   Sun  Dinner     2    20.797159
1         10.34  1.66    Male     No   Sun  Dinner     3    20.797159
2         21.01  3.50    Male     No   Sun  Dinner     3    20.797159
3         23.68  3.31    Male     No   Sun  Dinner     2    20.797159
4         24.59  3.61  Female     No   Sun  Dinner     4    20.797159
..          ...   ...     ...    ...   ...     ...   ...          ...
239       29.03  5.92    Male     No   Sat  Dinner     3    20.797159
240       27.18  2.00  Female    Yes   Sat  Dinner     2    20.797159
241       22.67  2.00    Male    Yes   Sat  Dinner     2    20.797159
242       17.82  1.75    Male     No   Sat  Dinner     2    20.797159
243       18.78  3.00  Female     No  Thur  Dinner     2    20.797159

[244 rows x 8 columns]